/* No comment provided by engineer. */
"%@ to %@" = "%1$@ ถึง %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$dวัน of %2$dวัน";

/* No comment provided by engineer. */
"%li to %li" = "%1$li ถึง %2$li";

/* No comment provided by engineer. */
"'item' parameter required" = "‘รายการ’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'portal' parameter required" = "‘พอร์ทัล’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'tags' parameter required" = "‘เท็ก’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"'title' parameter required" = "‘ชื่อ’ ต้องระบุพารามิเตอร์";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<ไม่มีค่า>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "การเข้าสู่ตำแหน่งของอุปกรณ์ถูกปฏิเสธ";

/* No comment provided by engineer. */
"Actual Size" = "ขนาดจริง";

/* No comment provided by engineer. */
"Add" = "เพิ่ม";

/* No comment provided by engineer. */
"Add Attachment" = "เพิ่มไฟล์แนบ";

/* No comment provided by engineer. */
"Add..." = "เพิ่ม...";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "รหัสรายการเป็นสิ่งจำเป็นสำหรับการดำเนินการนี้ เพิ่มรายการนี้ไปยังพอร์ทัลที่จะได้รับ Itemid";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "NSException ถูกตรวจพบ แต่ข้อมูลเดิมและคอลสเต๊กไม่สามารถใช้ได้ เบรคข้อยกเว้น Objective-C เพื่อดูบรรทัดของรหัสที่ก่อให้เกิด NSException เดิม สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีการทำเช่นนี้โปรดดูเอกสาร";

/* No comment provided by engineer. */
"Apply Geometry" = "ใช้ระบบเรขาคณิต";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "อย่างน้อย 1 สถานที่จำเป็นในการแก้เส้นทาง";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "อย่างน้อย 1 เหตุการณ์ที่เกิดขึ้นเป็นสิ่งจำเป็นที่จะแก้ปัญหาเส้นทาง";

/* No comment provided by engineer. */
"At least 2 stops are required to solve a route." = "ต้องใช้เวลาอย่างน้อย 2 จุดในการแก้เส้นทาง";

/* No comment provided by engineer. */
"Attachment" = "เอกสารแนบ";

/* No comment provided by engineer. */
"Attachments" = "แนบ";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "พยายามที่จะใช้ฟังก์ชั่นที่ไม่ได้รับการสนับสนุนสำหรับระดับใบอนุญาตในปัจจุบัน";

/* No comment provided by engineer. */
"Authorization required" = "ต้องได้รับอนุญาต";

/* No comment provided by engineer. */
"Bad Request" = "คำขอเสีย";

/* No comment provided by engineer. */
"Bad URL." = "URL เสีย";

/* No comment provided by engineer. */
"bytes" = "ไบต์";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "ไม่สามารถบันทึกลงในไอเท็มประเภทที่แตกต่างกันได้";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "ไม่สามารถตรวจสอบค่าของ '%@'";

/* No comment provided by engineer. */
"Certificate Required" = "ต้องการใบรับรอง";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "ความท้าทายสำหรับ URL:%1$@ กับเคาล้มเหลว:%2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "เปลี่ยนประเภทฟีเจอร์";

/* No comment provided by engineer. */
"Choose From Library" = "เลือกจากคลังภาพ";

/* No comment provided by engineer. */
"Clear" = "เคลียร์";

/* No comment provided by engineer. */
"Clear Geometry" = "ลบรูปเรขาคณิต";

/* No comment provided by engineer. */
"Continue" = "ต่อไป";

/* No comment provided by engineer. */
"Created %d hours ago" = "สร้างเมื่อ %d ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created %d minutes ago" = "สร้างเมื่อ %d นาทีที่แล้ว";

/* No comment provided by engineer. */
"Created a minute ago" = "สร้างเมื่อไม่กี่นาทีที่แล้ว";

/* No comment provided by engineer. */
"Created an hour ago" = "สร้างเมื่อไม่กี่ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created by %@" = "สร้างโดย %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "สร้างขึ้นโดย%1$@ %2$d ชั่วโมงที่ผ่านมา";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "สร้างขึ้นโดย%1$@ %2$d นาทีที่ผ่านมา";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "สร้างโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "สร้างโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "สร้างขึ้นโดย%1$@ บน%2$@ ที่%3$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "สร้างขึ้นโดย%1$@ บน%2$@ ที่%3$@ - วัน";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "สร้างโดย %@ วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "สร้างเมื่อ%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "สร้างเมื่อ%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Created seconds ago" = "สร้างเมื่อไม่กี่วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Credential Required" = "ชื่อและรหัสผ่านที่ต้องใช้";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "ข้อมูลสำหรับแผนภูมิวงกลมไม่ถูกต้อง";

/* No comment provided by engineer. */
"Delete" = "ลบ";

/* No comment provided by engineer. */
"Delete Attachment" = "ลบเอกสารแนบ";

/* No comment provided by engineer. */
"Delete Feature" = "ลบฟีเจอร์";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "การลบสิ่งที่แนบมานี้จะเอามันออกไปจากแหล่งข้อมูลที่เกี่ยวข้องและป๊อปอัพ";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "การลบคุณลักษณะนี้จะเอามันออกไปจากแผนที่และเชื่อมโยงแหล่งข้อมูล";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "ข้อมูลเวลาทิศทางและระยะไม่ตรงกัน";

/* No comment provided by engineer. */
"Edit" = "แก้ไข";

/* No comment provided by engineer. */
"Edited %d hours ago" = "แก้ไขเมื่อ %d ชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "แก้ไขเมื่อ %d นาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited a minute ago" = "แก้เมื่อนาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited an hour ago" = "แก้ไขเมื่อชั่่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@" = "แก้ไขโดย %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "เรียบเรียงข้อมูลโดย%1$@ %2$d ชั่วโมงที่ผ่านมา";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "เรียบเรียงข้อมูลโดย%1$@ %2$d นาทีที่ผ่านมา";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "แก้ไขโดย %@ เมื่อหนึ่งนาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "แก้ไขโดย %@ เมื่อหนึ่งชั่วโมงที่แล้ว";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "เรียบเรียงข้อมูลโดย%1$@ บน%2$@ ที่%3$@ - วัน";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "เรียบเรียงข้อมูลโดย%1$@ บน%2$@ ที่%3$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "แก้ไขโดย %@ วินาทีที่แล้ว";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "แก้ไขใน%1$@ ที่%2$@ - วัน";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "แก้ไขใน%1$@ ที่%2$@ - เต็มรูปแบบ";

/* No comment provided by engineer. */
"Edited seconds ago" = "แก้ไขเมื่อวินาทีที่แล้ว";

/* No comment provided by engineer. */
"Empty username/password" = "ชื่อผู้ใช้/รหัสผ่านว่างเปล่า";

/* No comment provided by engineer. */
"Enter a date between %@ and %@" = "กรอกวันที่ระหว่าง %1$@ ถึง %2$@";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "ใส่ตัวเลขระหว่าง%1$@ และ%2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "ใส่ตัวเลขระหว่าง%1$i และ%2$i";

/* No comment provided by engineer. */
"Error" = "ข้อผิดพลาด";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "การเพิ่มลักษณะให้คีย์เชนผิดพลาด";

/* No comment provided by engineer. */
"Error adding keychain item" = "ข้อผิดพลาดในการเพิ่มรายการพวงกุญแจ";

/* No comment provided by engineer. */
"Error extracting identity" = "ข้อผิดพลาดการแยกลักษณะ";

/* No comment provided by engineer. */
"Error Loading Page" = "ข้อผิดพลาดในการโหลดหน้าเว็บ";

/* No comment provided by engineer. */
"Error removing keychain item" = "ข้อผิดพลาดในการลบรายการพวงกุญแจ";

/* No comment provided by engineer. */
"Error updating keychain item" = "ข้อผิดพลาดรายการปรับปรุงพวงกุญแจ";

/* No comment provided by engineer. */
"Exceeds maximum value (%@)" = "เกินค่าสูงสุด (%@)";

/* No comment provided by engineer. */
"Extra Large" = "ใหญ่พิเศษ";

/* No comment provided by engineer. */
"Facility (%1$@) has invalid added cost attribute names (%2$@)." = "สถานที่ (%1$@) มีข้อผิดพลาดในการเพิ่มราคาชื่อแอตทริบิวต์ (%2$@).";

/* No comment provided by engineer. */
"Facility (%1$@) has negative added cost attribute (%2$@)." = "สถานที่ (%1$@) มีการติดลบในการเพิ่มราคาแอตทริบิวต์ (%2$@).";

/* No comment provided by engineer. */
"Feature isn't valid." = "คุณลักษณะที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Finish" = "จบ";

/* No comment provided by engineer. */
"Finishing editing..." = "จบการแก้ไข ...";

/* No comment provided by engineer. */
"GB" = "กิกะไบต์";

/* No comment provided by engineer. */
"Geometry" = "เรขาคณิต";

/* No comment provided by engineer. */
"Hide" = "ซ่อน";

/* No comment provided by engineer. */
"Incident (%1$@) has invalid added cost attribute names (%2$@)." = "เหตุการณ์ (%1$@) มีข้อผิดพลาดในการเพิ่มราคาชื่อแอตทริบิวต์ (%2$@).";

/* No comment provided by engineer. */
"Incident (%1$@) has negative added cost attribute (%2$@)." = "เหตุการณ์ (%1$@) มีการติดลบในการเพิ่มราคาแอตทริบิวต์ (%2$@).";

/* No comment provided by engineer. */
"Insert Part" = "แทรกส่วน";

/* No comment provided by engineer. */
"Insert Vertex" = "แทรกจุดเชื่อมต่อ";

/* No comment provided by engineer. */
"Invalid argument." = "ข้อโต้แย้งไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid Credentials" = "ข้อมูลส่วนตัวใช้ไม่ได้";

/* No comment provided by engineer. */
"Invalid GPX data." = "ข้อมูล GPX ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Invalid groupID." = "groupID ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Joining this organization is supported by invitation only, you need to receive an invitation from the administrator" = "การเข้าร่วมองค์กรนี้จะต้องได้รับคำเชิญเท่านั้น คุณต้องได้รับคำเชิญจากผู้ดูแลระบบก่อน";

/* No comment provided by engineer. */
"KB" = "กิโลไบต์";

/* No comment provided by engineer. */
"Keep Current Values" = "เก็บค่าปัจจุบัน";

/* No comment provided by engineer. */
"Large" = "ใหญ่";

/* No comment provided by engineer. */
"Less than minimum value (%@)" = "น้อยกว่าค่าต่ำสุด (%@)";

/* No comment provided by engineer. */
"Licensed for Developer Use Only" = "ใบอนุญาตสำหรับนักพัฒนาซอฟท์แวร์เท่านั้น";

/* No comment provided by engineer. */
"Loading feature..." = "กำลังโหลดฟีเจอร์…";

/* No comment provided by engineer. */
"Map contains data that cannot be saved. To save this map, which will remove this data, pass true for forceSaveToSupportedVersion." = "แผนที่มีข้อมูลที่ไม่สามารถบันทึกได้ หากต้องการบันทึกแผนที่นี้ ซึ่งจะเป็นการลบข้อมูลนี้ด้วย ให้ส่งผ่านข้อมูลสำหรับ forceSaveToSupportedVersion.";

/* No comment provided by engineer. */
"MB" = "เมกะไบต์";

/* No comment provided by engineer. */
"Medium" = "กลาง";

/* No comment provided by engineer. */
"Missing client certificate" = "ใบรับรองผู้ใช้งานที่หายไป";

/* string to represent hyperlink attributes */
"More Info" = "ข้อมูลเพิ่มเติม";

/* No comment provided by engineer. */
"Move Geometry" = "ย้ายรูปทรงเลขา";

/* No comment provided by engineer. */
"Move Part" = "ย้ายบางส่วน";

/* No comment provided by engineer. */
"Move Vertex" = "ย้ายจุดเชื่อมต่อ";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "ไม่พบใบรับรองในการเข้าถึงแหล่งที่มาข้อมูล '%@'";

/* No comment provided by engineer. */
"No data to create a bar chart" = "ไม่มีข้อมูลที่จะสร้างแผนภูมิแท่ง";

/* No comment provided by engineer. */
"No data to create a line chart" = "ไม่มีข้อมูลที่จะสร้างแผนภูมิเส้น";

/* No comment provided by engineer. */
"No data to create a pie chart" = "ไม่มีข้อมูลสำหรับสร้างแผนภูมิวงกลม";

/* No comment provided by engineer. */
"No image to display" = "ไม่มีภาพที่จะแสดง";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "ไม่พบเส้นทางระหว่างจุดต่างๆที่ให้มา (%@).";

/* No comment provided by engineer. */
"Not a valid number" = "ไม่ใช่ตัวเลขที่ถูกต้อง";

/* No comment provided by engineer. */
"Not a valid whole number" = "ไม่ใช่จำนวนเต็มที่ถูกต้อง";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "วัตถุที่ไม่สามารถสร้างได้โดยไม่ต้องพอร์ทัล ใช้ fromJSON: ด้วยประตู: ข้อผิดพลาด: วิธีการแทน";

/* No comment provided by engineer. */
"OK" = "ตกลง";

/* No comment provided by engineer. */
"One or more accumulate attribute names (%@) are invalid." = "ชื่อแอตทริบิวต์สะสมอย่างน้อยหนึ่งรายการ (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more attribute names (%@) associated with the custom parameter attribute values are invalid." = "ชื่อแอตทริบิวต์อย่างน้อยหนึ่งรายการ (%@) มีความเชื่อมโยงกับค่าแอตทริบิวต์พารามิเตอร์ที่กำหนดเองไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more facilities (%@) have a null geometry." = "สถานที่อย่างน้อยหนึ่งรายการ (%@) ไม่มีค่ารูปทรงเรขาคณิต";

/* No comment provided by engineer. */
"One or more facilities (%@) have an invalid curb approach." = "สถานที่อย่างน้อยหนึ่งรายการ (%@) มีการกีดขวางที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more facilities (%@) have invalid impedance cutoff." = "สถานที่อย่างน้อยหนึ่งรายการ (%@) มีค่าตัวแปรไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more incidents (%@) have a null geometry." = "เหตุการณ์อย่างน้อยหนึ่งเหตุการณ์ (%@)ไม่มีค่ารูปทรงเรขาคณิต";

/* No comment provided by engineer. */
"One or more incidents (%@) have an invalid curb approach." = "เหตุการณ์อย่างน้อยหนึ่งเหตุการณ์ (%@) มีการกีดขวางที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more incidents (%@) have invalid impedance cutoff." = "เหตุการณ์อย่างน้อยหนึ่งเหตุการณ์ (%@) มีค่าตัวแปรไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more incidents (%@) have less than 1 target facility count." = "เหตุการณ์อย่างน้อยหนึ่งเหตุการณ์ (%@) มีจำนวนสถานที่เป้าหมายน้อยกว่า 1 แห่ง";

/* No comment provided by engineer. */
"One or more parameter names (%@) associated with the custom parameter attribute values are invalid." = "ชื่อพารามิเตอร์อย่างน้อยหนึ่งรายการ (%@) มีความเชื่อมโยงกับค่าแอตทริบิวต์พารามิเตอร์ที่กำหนดเองไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more parameter value types associated with the custom parameter attribute values (%@) are invalid." = "ประเภทค่าพารามิเตอร์อย่างน้อยหนึ่งค่าที่เชื่อมโยงกับค่าแอตทริบิวต์พารามิเตอร์ที่กำหนดเอง (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more point barriers (%@) are unlocated." = "จุดห้ามผ่านหนึ่งหรือหลายจุด (%@) ไม่สามารถวางตำแหน่งได้";

/* No comment provided by engineer. */
"One or more point barriers (%@) have a null geometry." = "จุดห้ามผ่านหนึ่งหรือหลายจุด (%@) ไม่มีค่าเรขาคณิต";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid added cost attribute name." = "จุดห้ามผ่านหนึ่งหรือหลายจุด (%@) มีข้อผิดพลาดในการเพิ่มราคาชื่อแอตทริบิวต์";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid curb approach." = "จุดห้ามผ่านหนึ่งหรือหลายจุด (%@) มีการกีดขวางที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) does not cover any network elements." = "พื้นที่ห้ามผ่านหนึ่งหรือหลายแห่ง (%@) ไม่ครอบคลุมองค์ประกอบเครือข่าย";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have a null geometry." = "พื้นที่ห้ามผ่านหนึ่งหรือหลายแห่ง (%@) ไม่มีค่าเรขาคณิต";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have an invalid scaled cost attribute name." = "พื้นที่ห้ามผ่านหนึ่งหรือหลายแห่ง (%@) มีข้อผิดพลาดในขนาดราคาชื่อแอตทริบิวต์";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) does not cover any network elements." = "เส้นห้ามผ่านหนึ่งหรือหลายเส้น (%@) ไม่ครอบคลุมองค์ประกอบเครือข่าย";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have a null geometry." = "เส้นห้ามผ่านหนึ่งหรือหลายเส้น (%@) ไม่มีค่าเรขาคณิต";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have an invalid scaled cost attribute name." = "เส้นห้ามผ่านหนึ่งหรือหลายเส้น (%@) มีข้อผิดพลาดในขนาดราคาชื่อแอตทริบิวต์";

/* No comment provided by engineer. */
"One or more restriction attribute names (%@) are invalid." = "ข้อจำกัดหนึ่งแห่งหรือมากกว่ามีชื่อแอตทริบิวต์ (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values (%2$@) are invalid." = "ค่าการใช้งานข้อจำกัดหนึ่งแห่งหรือมากกว่า (%1$@) ที่เกี่ยวข้องกับค่าแอตทริบิวต์พารามิเตอร์ที่กำหนดเอง (%2$@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values ((%2$@) are neutral (i.e., have no effect)." = "ค่าการใช้งานข้อจำกัดหนึ่งแห่งหรือมากกว่า (%1$@) ที่เกี่ยวข้องกับค่าแอตทริบิวต์พารามิเตอร์ที่กำหนดเอง ((%2$@) เป็นกลาง (i.e., have no effect).";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a non-traversable element." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) ถูกวางตำแหน่งอยู่บนองค์ประกอบที่ไม่สามารถข้ามได้";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a soft-restricted element." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) ถูกวางตำแหน่งบนองค์ประกอบที่มีข้อจำกัดไม่มาก";

/* No comment provided by engineer. */
"One or more stops (%@) are unlocated." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) ไม่สามารถวางตำแหน่งได้";

/* No comment provided by engineer. */
"One or more stops (%@) cannot be reached from other stops." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) ไม่สามารถเข้าถึงได้จากจุดแวะพักอื่น";

/* No comment provided by engineer. */
"One or more stops (%@) have a null geometry." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) ไม่มีค่าเรขาคณิต";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window end that occurs before its time window start." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) มีจุดสิ้นสุดของหน้าต่างเวลาที่เกิดขึ้นก่อนเวลาเริ่มต้นของหน้าต่าง";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window that starts before January 1, 1970." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) มีหน้าต่างเวลาที่เริ่มต้นก่อน 1 มกราคม ค.ศ. 1970";

/* No comment provided by engineer. */
"One or more stops (%@) have an invalid curb approach." = "จุดแวะพักหนึ่งแห่งหรือมากกว่า (%@) มีวิธีกีดขวางที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"Open in Safari" = "เปิดใน Safari";

/* No comment provided by engineer. */
"Password" = "รหัสผ่าน";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "กรุณาใส่ชื่อสำหรับสิ่งที่แนบมาใหม่";

/* No comment provided by engineer. */
"Polygon barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "พื้นที่ห้ามผ่าน (%1$@) มีค่าใช้จ่ายที่เป็นค่าลบหรือเป็นศูนย์ (%2$@).";

/* No comment provided by engineer. */
"Polyline barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "เส้นห้ามผ่าน (%1$@) มีค่าใช้จ่ายที่เป็นค่าลบหรือเป็นศูนย์ (%2$@).";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "เส้นจำนวนมากไม่กลับมา";

/* No comment provided by engineer. */
"Public Account user cannot access this application." = "บัญชีสาธารณะไม่สามารถเข้าใช้งานแอพพลิเคชั่นนี้ได้";

/* No comment provided by engineer. */
"Remove Part" = "ลบบางส่วนออก";

/* No comment provided by engineer. */
"Remove Vertex" = "ลบเวอเท็กซ์";

/* No comment provided by engineer. */
"Reordering stops (Traveling Salesman Problem) is not supported when the collection of stops contains waypoints or rest breaks." = "เรียงลำดับการวางจุดแวะพักใหม่ (Traveling Salesman Problem) ไม่ได้รับการสนับสนุนเมื่อกลุ่มของจุดแวะพักประกอบไปด้วยจุดที่กำหนดหรือส่วนที่เหลือ";

/* No comment provided by engineer. */
"Reset to Default Values" = "รีเซ็ตไปที่ค่าเริ่มต้น";

/* No comment provided by engineer. */
"Retry" = "ลองใหม่";

/* No comment provided by engineer. */
"Route starts or ends on a waypoint." = "เส้นทางเริ่มต้นหรือสิ้นสุดบนจุดที่กำหนด";

/* No comment provided by engineer. */
"Save Image" = "บันทึกรูปภาพ";

/* No comment provided by engineer. */
"Save Movie" = "บันทึกภาพยนตร์";

/* No comment provided by engineer. */
"Sign In" = "ลงชื่อเข้าใช้";

/* No comment provided by engineer. */
"Skip" = "ข้ามไป";

/* No comment provided by engineer. */
"Small" = "เล็ก";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "วันเวลาเริ่มต้นที่ระบุเกิดขึ้นก่อนวันที่ 1 มกราคม ปี ค.ศ. 1970";

/* No comment provided by engineer. */
"Stop (%1$@) has invalid added cost attribute names (%2$@)." = "จุดแวะพัก (%1$@) มีข้อผิดพลาดในการเพิ่มราคาชื่อแอตทริบิวต์ (%2$@).";

/* No comment provided by engineer. */
"Take Photo or Video" = "ถ่ายรูปภาพหรือวิดิโอ";

/* No comment provided by engineer. */
"The default impedance cutoff is invalid." = "ค่าตั้งต้นตัวแปรอิมพีแดนซ์ไม่ถูกต้อง";

/* No comment provided by engineer. */
"The default target facility count is invalid." = "ค่าตั้งต้นจำนวนสถานที่ปลายทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions distance attribute name (%@) is invalid." = "ชื่อแอตทริบิวต์ระยะไกลทิศทาง (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions language is invalid." = "ภาษาทิศทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "ข้อมูลประเภทถนนไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions style is invalid." = "สไตล์ทิศทางไม่ถูกต้อง";

/* No comment provided by engineer. */
"The directions time attribute name (%@) is invalid." = "ชื่อแอตทริบิวต์เวลาเส้นทาง (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"The impedance attribute name (%@) is invalid." = "ชื่อแอตทริบิวต์ค่าอิมพีแดนซ์ (%@) ไม่ถูกต้อง";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "ระบบพิกัดของข้อมูลนำเข้าไม่ได้ถูกระบุ";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "เน็ตเวิร์คไม่มีข้อมูลลำดับศักดิ์สำหรับการวางแผนเส้นทางตามลำดับศักดิ์";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "ข้อมูลนี้ต้องบันทึกไว้ในพอร์ทัลโดยใช้การ 'saveAs:' เสียก่อนในครั้งแรก";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "ระบบพิกัดของผลลัพธ์ไม่ได้ถูกระบุ";

/* No comment provided by engineer. */
"The polygon buffer distance is invalid." = "ระยะกันชนของพื้นที่ไม่ถูกต้อง";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "แหล่งที่มาข้อมูลที่คุณกำลังมองหาอาจจะถูกลบออก มีการเปลี่ยนชื่อหรือไม่สามารถใช้ได้ชั่วคราว";

/* No comment provided by engineer. */
"The resulting route has traversed one or more soft-restricted elements (%@)." = "เส้นทางที่เกิดขึ้นได้ผ่านองค์ประกอบที่ถูกจำกัดไว้ อย่างน้อยหนึ่งองค์ประกอบ (%@).";

/* No comment provided by engineer. */
"The route is too large to solve using the walking travel mode." = "เส้นทางยาวเกินไปที่จะแก้ปัญหาโดยใช้โหมดเดินทางเท้า";

/* No comment provided by engineer. */
"The search where clause is not supported." = "ไม่สนับสนุนการค้นหาแบบ where clause";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "ใบรับรองของเซิร์ฟเวอร์ไม่ถูกต้อง คุณอาจมีการเชื่อมต่อกับเซิร์ฟเวอร์ที่เป็น '%@' ซึ่งทำให้การวางข้อมูลที่มีความลับของคุณลงไปมีความเสี่ยง คุณต้องการที่จะเชื่อมต่อไปหรือไม่?";

/* No comment provided by engineer. */
"The service cannot properly calculate time shift." = "บริการนี้ไม่สามารถคำนวณการเปลี่ยนแปลงเวลาได้อย่างถูกต้อง";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "ClientID ที่ระบุไม่ถูกต้อง";

/* No comment provided by engineer. */
"The stop type property was ignored for stops (%@) because the server does not support selected type of stop." = "ประเภทคุณสมบัติจุดแวะพักถูกละเลยสำหรับจุดแวะพักนี้ (%@) เพราะเซิร์ฟเวอร์ไม่สนับสนุนการเลือกประเภทของจุดแวะพัก";

/* No comment provided by engineer. */
"The travel mode has been set to default." = "โหมดการเดินทางได้ถูกตั้งค่าเป็นค่าเริ่มต้น";

/* No comment provided by engineer. */
"The waypoints (%@) contain added cost attribute." = "จุดต่างๆ (%@) การเพิ่มแอตทริบิวต์ราคาเพิ่ม";

/* No comment provided by engineer. */
"The waypoints (%@) contain time windows." = "จุดต่างๆ (%@) มีหน้าต่างเวลา";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "เกิดข้อผิดพลาดในการโหลดคุณลักษณะเป็น กรุณาตรวจสอบการเชื่อมต่อเครือข่ายของคุณ";

/* No comment provided by engineer. */
"Time windows start date was changed." = "วันที่เริ่มต้นของหน้าต่างเวลามีการเปลี่ยนแปลง";

/* No comment provided by engineer. */
"Time windows were ignored because the impedance attribute is not time based." = "หน้าต่างเวลาถูกละเลยเนื่องจากค่าแอตทริบิวต์ตัวแปรไม่ได้ขึ้นอยู่กับเวลา";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "ในการบันทึกเป็นรายการใหม่ คุณต้องลงทะเบียนเข้าสู่ระบบพอร์ทัล";

/* No comment provided by engineer. */
"Today" = "วันนี้";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Token ไม่ถูกต้องหรือหมดอายุ";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "Token URL ว่างเปล่า คุณต้องใส่ Token URL ที่ถูกต้อง";

/* No comment provided by engineer. */
"Unable to login with provided credentials." = "ไม่สามารถเข้าสู่ระบบด้วยข้อมูลประจำตัวที่ได้รับ";

/* No comment provided by engineer. */
"Unable to retrieve user profile from the provider" = "ไม่สามารถดึงข้อมูลโปรไฟล์ผู้ใช้จากผู้ให้บริการ";

/* No comment provided by engineer. */
"Unauthorized access" = "การเข้าถึงไม่ได้รับอนุญาต";

/* No comment provided by engineer. */
"Unknown authentication error" = "ข้อผิดพลาดการพิสูจน์ที่ไม่ทราบสาเหตุ";

/* No comment provided by engineer. */
"Unknown condition." = "เงื่อนไขที่ไม่รู้จัก";

/* No comment provided by engineer. */
"Unknown error occurred" = "เกิดข้อผิดพลาดที่ไม่ทราบสาเหตุ";

/* No comment provided by engineer. */
"Unsupported GPX data." = "ไม่รองรับข้อมูล GPX";

/* No comment provided by engineer. */
"User canceled error" = "ผู้ใช้ยกเลิกเกิดข้อผิดพลาด";

/* No comment provided by engineer. */
"User licenses assigned by your organization are invalid. Please contact your administrator to adjust the license assignments and try again." = "การอนุญาตผู้ใช้งานโดยองค์กรมีข้อผิดพลาด กรุณาติดต่อผู้ดูแลระบบเพื่อจัดการการอนุญาตใหม่อีกครั้ง";

/* No comment provided by engineer. */
"Username" = "ชื่อผู้ใช้งาน";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "โดยใช้เบราว์เซอร์ในการตรวจสอบ…";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "คุ้มค่าเกินความยาวสูงสุดของสนาม%lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "คุณกำลังจะเปลี่ยนประเภทของข้อมูล คุณต้องการที่จะเก็บค่าปัจจุบันของคุณ (ที่เป็นไปได้) หรือรีเซ็ตเป็นค่าเริ่มต้น?";

/* No comment provided by engineer. */
"You cannot sign in because you do not have an organization account associated with your social network credentials" = "คุณไม่สามารถลงชื่อเข้าใช้เนื่องจากคุณไม่มีบัญชีองค์กรที่เชื่อมโยงกับข้อมูลรับรองเครือข่ายทางสังคมของคุณ";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "คุณไม่ได้มีสิทธิ์ในการเข้าถึงแหล่งข้อมูลนี้";

/* No comment provided by engineer. */
"You do not have sufficient user level to access this application." = "คุณไม่ได้มีระดับผู้ใช้เพียงพอในการเข้าถึงโปรแกรมนี้";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "คุณต้องลงทะเบียนไปยังพอร์ทัลเพื่อการดำเนินการนี้";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "คุณจะต้องระบุให้คะแนนระหว่าง 1 และ 5";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "คุณต้องระบุคีย์คำอธิบายการใช้งานที่ตั้ง (NSLocationWhenInUseUsageDescription หรือ NSLocationAlwaysUsageDescription) ใน plist ของคุณ";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "คุณต้องเลือกใบรับรองเพื่อเข้าถึงแหล่งที่มาข้อมูล'%@'";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "คุณจำเป็นต้องเข้าสู่ระบบเพื่อเข้าถึงแหล่งที่มาข้อมูล'%@'";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "ซม.";
"dd" = "ว";
"dm" = "dm";
"ft" = "ft";
"in" = "ใน";
"km" = "กม.";
"m" = "ม.";
"mi" = "ไมล์";
"mm" = "มม.";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "ไม่ทราบ";
"yd" = "ป ด";

/* Unit Display Strings */
"Centimeters" = "เซ็นติเมตร";
"Decimal Degrees" = "เดซิมอล ดีกรี";
"Decimeters" = "เดซิเมตร";
"Feet" = "ฟุต";
"Inches" = "นิ้ว";
"Kilometers" = "กิโลเมตร";
"Meters" = "เมตร";
"Miles" = "ไมล์";
"Millimeters" = "มิลลิเมตร";
"Nautical Miles" = "ไมล์ทะเล";
"Points" = "จุด";
"Yards" = "หลา";

/* Area Units Abbreviated Strings */
"sq. in" = "ตร.น.";
"sq. ft" = "ตร.ฟ.";
"sq. yd" = "ตร.หลา";
"ac" = "เอเคอร์";
"sq. mi" = "ตร.ไมล์";
"sq. mm" = "ตร.มม.";
"sq. cm" = "ตร.ซม.";
"sq. dm" = "ตร.ดม.";
"sq. m" = "ตร.ม.";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "ตร.กม.";

/* Area Units Display Strings */
"Square Inches" = "ตารางนิ้ว";
"Square Feet" = "ตารางฟุต";
"Square Yards" = "ตารางหลา";
"Acres" = "เอเคอร์";
"Square Miles" = "ตารางไมล์";
"Square Millimeters" = "ตารางมิลลิเมตร";
"Square Centimeters" = "ตารางเซนติเมตร";
"Square Decimeters" = "ตารางเดซิเมตร";
"Square Meters" = "ตารางเมตร";
"Ares" = "Ares";
"Hectares" = "เฮกตาร์";
"Square Kilometers" = "ตารางกิโลเมตร";

